[
  {
    "id": "d7e62387-9b5c-4eee-86ac-cfb11ce14bfc",
    "name": "Men's Denim Jacket",
    "price": 49.99,
    "rating_avg": 4.3,
    "quantity_of_ratings": 220,
    "image": "https://static.nike.com/a/images/t_PDP_1728_v1/f_auto,q_auto:eco/611f084c-ddd9-4f04-84d5-f9f09d3640c2/M+NK+SF+WR+PL-FLD+HD+JKT.png",
    "color": "Gray",
    "description": "This timeless Men's Denim Jacket is a wardrobe staple designed to elevate your casual outfits. Crafted with durable denim, this jacket offers a relaxed fit that’s both stylish and practical. Whether you’re heading to a weekend brunch, a casual day out with friends, or layering it for extra warmth during colder months, this jacket has you covered. The classic blue wash pairs easily with almost any outfit, making it a versatile piece you’ll reach for time and time again. Featuring two front pockets and button closures, it exudes a rugged yet refined charm that never goes out of style. The jacket is also soft to the touch, providing comfort alongside its fashionable look. Perfect for creating effortless cool looks, this is the denim jacket every man needs in his wardrobe.",
    "country": "USA",
    "region": "North America"
  },
  {
    "id": "f7e62387-9b5c-4eee-86ac-cfb11ce14bfc",
    "name": "Women's Summer Sportswear",
    "price": 34.99,
    "rating_avg": 4.7,
    "quantity_of_ratings": 180,
    "image": "https://static.nike.com/a/images/t_PDP_1728_v1/f_auto,q_auto:eco/9be3d488-1aac-48af-a8c4-fd92e8511d1f/W+NSW+CLLCTN+RPL+ZIP+JKT+OTG.png",
    "color": "Floral Print",
    "description": "Stay cool and stylish this season with Women's Summer Sportswear, designed to combine functionality with vibrant summer vibes. Featuring a delightful floral print, this lightweight sportswear is perfect for warm-weather activities, from outdoor workouts to casual strolls. The breathable fabric ensures maximum comfort, while the flexible fit allows freedom of movement for any activity. Whether you're hitting the track, running errands, or relaxing in the sun, this sportswear blends performance and fashion seamlessly. Add a pop of summer energy to your athletic wardrobe with this must-have piece, tailored for the active woman who doesn’t compromise on style.",
    "country": "Italy",
    "region": "Europe"
  },
  {
    "id": "g7e62387-9b5c-4eee-86ac-cfb11ce14bfc",
    "name": "Men's Running Shoes",
    "price": 69.99,
    "rating_avg": 4.5,
    "quantity_of_ratings": 150,
    "image": "https://static.nike.com/a/images/t_PDP_1728_v1/f_auto,q_auto:eco,u_126ab356-44d8-4a06-89b4-fcdcc8df0245,c_scale,fl_relative,w_1.0,h_1.0,fl_layer_apply/0d26b559-372c-4d03-8169-fa1d70d67ebf/JORDAN+SPIZIKE+LOW.png",
    "color": "Black/Red",
    "description": "Boost your athletic performance with these Men's Running Shoes, designed to provide the ultimate combination of comfort, style, and durability. Whether you're a seasoned runner or just starting your fitness journey, these shoes are built to support every stride. The breathable upper ensures your feet stay cool, while the cushioned sole absorbs shock to protect your joints during high-impact activities. The sleek black and red design gives them a modern, sporty look that easily transitions from the track to casual outings. With a durable rubber outsole, these shoes provide excellent grip and traction, ensuring you can run with confidence, no matter the terrain. Improve your running game while enjoying all-day comfort in these top-rated shoes.",
    "country": "China",
    "region": "Asia"
  },
  {
    "id": "h7e62387-9b5c-4eee-86ac-cfb11ce14bfc",
    "name": "Women's Sportswear",
    "price": 59.99,
    "rating_avg": 4.6,
    "quantity_of_ratings": 130,
    "image": "https://static.nike.com/a/images/t_PDP_1728_v1/f_auto,q_auto:eco/cb914fa4-b363-4801-8ecc-b0ca144ea200/W+NSW+STREET+WVN+JKT.png",
    "color": "Gray",
    "description": "Elevate your athletic wardrobe with Women's Sportswear that combines performance, comfort, and style. Designed for active women, this sportswear is perfect for workouts, casual outings, or lounging in comfort. The gray color ensures versatility, while the premium fabric offers breathability and durability. Whether you're hitting the gym, going for a run, or running errands, this sportswear provides a sleek look and superior fit. Experience freedom of movement and all-day comfort with this essential addition to your sports collection.",
    "country": "Germany",
    "region": "Europe"
  },
  {
    "id": "i7e62387-9b5c-4eee-86ac-cfb11ce14bfc",
    "name": "Unisex Hoodie",
    "price": 39.99,
    "rating_avg": 4.2,
    "quantity_of_ratings": 200,
    "image": "https://static.nike.com/a/images/t_PDP_1728_v1/f_auto,q_auto:eco,u_126ab356-44d8-4a06-89b4-fcdcc8df0245,c_scale,fl_relative,w_1.0,h_1.0,fl_layer_apply/035a8147-4ffc-4ba9-a453-3fa163d3a0ad/LAL+MNK+FLC+PO+CTS+ST.png",
    "color": "Pink",
    "description": "Looking for comfort and versatility? This Unisex Hoodie is perfect for all your casual wear needs. Crafted from a soft, durable fabric, this hoodie offers a relaxed fit that’s both cozy and stylish. The classic black color makes it easy to pair with any outfit, whether you’re lounging at home, running errands, or meeting up with friends. The roomy hood adds an extra layer of warmth when you need it, and the front kangaroo pocket gives you a convenient place to store your essentials. With a simple yet trendy design, this hoodie works for anyone, regardless of gender, making it a perfect addition to any wardrobe. Whether you're heading to the gym, going on an outdoor adventure, or just lounging around, this hoodie delivers comfort and style.",
    "country": "Canada",
    "region": "North America"
  },
  {
    "id": "j7e62387-9b5c-4eee-86ac-cfb11ce14bfc",
    "name": "Men's Casual Sneakers",
    "price": 54.99,
    "rating_avg": 4.4,
    "quantity_of_ratings": 175,
    "image": "https://cdn-images.farfetch-contents.com/14/09/95/41/14099541_18552572_1000.jpg",
    "color": "White/Blue",
    "description": "Step up your casual game with these Men's Casual Sneakers, combining comfort and contemporary design. Featuring a breathable mesh upper and cushioned insoles, these sneakers are perfect for long walks, casual outings, or even office wear. The stylish white and blue combination makes them a standout addition to your shoe collection. With a durable rubber sole for enhanced traction, these sneakers are as functional as they are fashionable.",
    "country": "Japan",
    "region": "Asia"
  },
  {
    "id": "k7e62387-9b5c-4eee-86ac-cfb11ce14bfc",
    "name": "Women's Yoga Pants",
    "price": 29.99,
    "rating_avg": 4.8,
    "quantity_of_ratings": 210,
    "image": "https://cdn-images.farfetch-contents.com/22/61/58/14/22615814_53378857_1000.jpg",
    "color": "Black",
    "description": "Achieve ultimate comfort and flexibility with these Women's Yoga Pants, designed to move with you during every pose. Crafted from a high-performance stretch fabric, these pants offer a flattering fit and moisture-wicking properties to keep you cool and dry. The sleek black design ensures they pair effortlessly with your favorite tops, whether for yoga, gym sessions, or casual wear.",
    "country": "India",
    "region": "Asia"
  },
  {
    "id": "l7e62387-9b5c-4eee-86ac-cfb11ce14bfc",
    "name": "Men's Leather Belt",
    "price": 19.99,
    "rating_avg": 4.1,
    "quantity_of_ratings": 100,
    "image": "https://cdn-images.farfetch-contents.com/26/46/51/54/26465154_56214797_1000.jpg",
    "color": "Brown",
    "description": "Add a touch of sophistication to your attire with this Men's Leather Belt, made from high-quality leather for a polished and professional look. Its durable construction ensures long-lasting wear, while the adjustable buckle provides a comfortable fit. Perfect for both formal occasions and casual outfits, this belt is a wardrobe essential for the modern man.",
    "country": "USA",
    "region": "North America"
  },
  {
    "id": "m7e62387-9b5c-4eee-86ac-cfb11ce14bfc",
    "name": "Women's Winter Coat",
    "price": 89.99,
    "rating_avg": 4.9,
    "quantity_of_ratings": 320,
    "image": "https://cdn-images.farfetch-contents.com/13/34/22/86/13342286_51586415_1000.jpg",
    "color": "Navy Blue",
    "description": "Stay warm and chic with this Women's Winter Coat, designed for cold weather without compromising on style. Featuring a plush insulated lining and water-resistant fabric, this coat is ideal for snowy or rainy days. The elegant navy-blue shade pairs well with any winter outfit, while the adjustable hood and deep pockets add functionality and comfort.",
    "country": "Sweden",
    "region": "Europe"
  },
  {
    "id": "n7e62387-9b5c-4eee-86ac-cfb11ce14bfc",
    "name": "Unisex Beanie",
    "price": 14.99,
    "rating_avg": 4.3,
    "quantity_of_ratings": 90,
    "image": "https://cdn-images.farfetch-contents.com/14/49/04/60/14490460_22904293_1000.jpg",
    "color": "Black",
    "description": "Keep your head warm with this stylish Unisex Beanie, crafted from soft knit fabric for ultimate comfort. Its minimalist black design makes it versatile enough to pair with any outfit. Perfect for winter outings or adding a trendy touch to your casual wear, this beanie is a must-have accessory.",
    "country": "Canada",
    "region": "North America"
  },
  {
    "id": "n7e62387-9b5c-4eee-86ac-cfb11ce14bfc",
    "name": "Unisex Beanie",
    "price": 14.99,
    "rating_avg": 4.3,
    "quantity_of_ratings": 90,
    "image": "https://cdn-images.farfetch-contents.com/25/75/93/61/25759361_56048838_1000.jpg",
    "color": "Black",
    "description": "Keep your head warm with this stylish Unisex Beanie, crafted from soft knit fabric for ultimate comfort. Its minimalist black design makes it versatile enough to pair with any outfit. Perfect for winter outings or adding a trendy touch to your casual wear, this beanie is a must-have accessory.",
    "country": "Canada",
    "region": "North America"
  },
  {
    "id": "n7e62387-9b5c-4eee-86ac-cfb11ce14bfc",
    "name": "Unisex Beanie",
    "price": 14.99,
    "rating_avg": 4.3,
    "quantity_of_ratings": 90,
    "image": "https://static.nike.com/a/images/t_PDP_1728_v1/f_auto,q_auto:eco/c74b4886-b77b-4613-82b9-3a38686d7e36/M+NSW+CLUB+HOODIE+PO+FT.png",
    "color": "Black",
    "description": "Keep your head warm with this stylish Unisex Beanie, crafted from soft knit fabric for ultimate comfort. Its minimalist black design makes it versatile enough to pair with any outfit. Perfect for winter outings or adding a trendy touch to your casual wear, this beanie is a must-have accessory.",
    "country": "Canada",
    "region": "North America"
  }
]
